# IsDefault Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComponentRepeaterSlot..::..IsDefault Property
ComponentRepeaterSlot Class See Also
---
A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsDefault { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDefault As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDefault {
	bool get ();
}
```

# See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace